## [ethanhassett](https://hassettio.app.spacelift.io/stack/ethanhassett/run/01J9HYNCTCDH0X9Y6S48THEX27) plan logs

<details>
<summary>Click here to expand</summary>

```
[01J9DSFRY26PD9TJ60F92J40S3] Planning changes with 0 custom hooks...
data.hcp_vault_secrets_secret.google_credentials: Reading...
data.hcp_vault_secrets_secret.cloudflare_api_token: Reading...
data.hcp_vault_secrets_secret.cloudflare_api_token: Read complete after 0s [id=spacelift]
data.cloudflare_zone.this: Reading...
data.hcp_vault_secrets_secret.google_credentials: Read complete after 0s [id=spacelift]
google_service_account.cloud_run: Refreshing state... [id=projects/ethanhassett/serviceAccounts/cloudrun@ethanhassett.iam.gserviceaccount.com]
google_project_iam_binding.cloud_run_admin: Refreshing state... [id=ethanhassett/roles/run.admin]
google_project_iam_binding.service_account_user: Refreshing state... [id=ethanhassett/roles/iam.serviceAccountUser]
google_cloud_run_v2_service.this: Refreshing state... [id=projects/ethanhassett/locations/us-east1/services/ethanhassett]
data.cloudflare_zone.this: Read complete after 1s [id=f96446d78e054da3fe5c6ace7557f782]
cloudflare_record.www: Refreshing state... [id=abe64f445c160f7a9ef79eba056048c8]
cloudflare_record.a["216.239.34.21"]: Refreshing state... [id=3d4d004aeaae016a183b893188490a37]
cloudflare_record.a["216.239.38.21"]: Refreshing state... [id=2a1d5c844e59a05273e7ee6a46e14178]
cloudflare_record.a["216.239.32.21"]: Refreshing state... [id=9a171cf6f35f813d3b6ca21175a2c23c]
cloudflare_record.aaaa["2001:4860:4802:34::15"]: Refreshing state... [id=228e4cefd202c650520e3248c66988b6]
cloudflare_record.aaaa["2001:4860:4802:32::15"]: Refreshing state... [id=75713c511a91630f0e8b0d9f75e9e801]
cloudflare_record.a["216.239.36.21"]: Refreshing state... [id=03b11c6bb0ab016837e8bc94246f4c56]
cloudflare_record.aaaa["2001:4860:4802:36::15"]: Refreshing state... [id=5cf02e36b18c6242726fd9deb1295f8e]
cloudflare_record.aaaa["2001:4860:4802:38::15"]: Refreshing state... [id=b9b51c3eec5c1293de742c736c7ef500]
google_cloud_run_domain_mapping.this: Refreshing state... [id=locations/us-east1/namespaces/ethanhassett/domainmappings/ethanhassett.com]
google_cloud_run_service_iam_binding.this: Refreshing state... [id=v1/projects/ethanhassett/locations/us-east1/services/ethanhassett/roles/run.invoker]
google_cloud_run_domain_mapping.www: Refreshing state... [id=locations/us-east1/namespaces/ethanhassett/domainmappings/www.ethanhassett.com]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # google_compute_instance.test will be created
  + resource "google_compute_instance" "test" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
          + "repo"                       = "ethanhassett"
        }
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "n2-standard-2"
      + metadata                = {
          + "foo" = "bar"
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = "echo hi > /test.txt"
      + min_cpu_platform        = (known after apply)
      + name                    = "test-instance"
      + project                 = "ethanhassett"
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
          + "repo"                       = "ethanhassett"
        }
      + zone                    = "us-east1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "debian-cloud/debian-11"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = (known after apply)
              + type                   = (known after apply)
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scratch_disk {
          + device_name = (known after apply)
          + interface   = "NVME"
          + size        = 375
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

[01J9DSFRY26PD9TJ60F92J40S3] Changes are GO
[01J9DSFRY26PD9TJ60F92J40S3] Uploading the list of managed resources...
[01J9DSFRY26PD9TJ60F92J40S3] Generating Infracost JSON report from plan
2024-10-06T22:20:19Z WARN 2 "google_cloud_run_v2_service" prices missing across 1 resource


[01J9DSFRY26PD9TJ60F92J40S3] Infracost report generated successfully
[01J9DSFRY26PD9TJ60F92J40S3] Mapping Infracost data to resources
[01J9DSFRY26PD9TJ60F92J40S3] Costs mapped successfully
[01J9DSFRY26PD9TJ60F92J40S3] Please be aware that the run changes calculation includes output changes.
[01J9DSFRY26PD9TJ60F92J40S3] Resource list upload is GO
[01J9DSFRY26PD9TJ60F92J40S3] Generating JSON representation of the plan...
[01J9DSFRY26PD9TJ60F92J40S3] JSON representation is GO
[01J9DSFRY26PD9TJ60F92J40S3] Generating Infracost JSON report from plan
2024-10-06T22:20:25Z WARN 2 "google_cloud_run_v2_service" prices missing across 1 resource


[01J9DSFRY26PD9TJ60F92J40S3] Infracost report generated successfully
[01J9DSFRY26PD9TJ60F92J40S3] Loading custom plan policy inputs...
[01J9DSFRY26PD9TJ60F92J40S3] 0 custom plan policy inputs found
[01J9DSFRY26PD9TJ60F92J40S3] No plan policies to evaluate
```

</details>